def T1():
    #A = [10, 15, 56, 65, 7, 12, 7, 34, 66, 60, 14, 23]
    #P = [112, 4445, 332, 4433, 7765, 3223, 7654, 66545, 433, 789, 5442, 978]
    A = []
    P = []
    SA = 0
    SP = 0
    for i in range (12):
        A.append(int(input(f"Введите площадь {i + 1} района: ")))
        P.append(int(input(f"Введите население {i + 1} района: ")))
        SA += A[i]
        SP += P[i]
    print("Средняя плотность населения по области: ", int(SP / SA), " чел/км")
    
def T2():
    Age = 1
    Sum = 1
    while Sum < 100:
        Age += 1
        Sum += Age
    print(f"Сумма превысит 100$ при достижении {Age} лет.")
T1()
T2()
