Python 3.8.10 (tags/v3.8.10:3d8993a, May  3 2021, 11:34:34) [MSC v.1928 32 bit (Intel)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> #Вариант 8. Имя, Фамилия, Отчество.
>>> def f1():
	a=input('Ваши фамилия, имя, отчество?')
	b=input('Чем Вы увлекаетесь?')
	print('Ваши имя, фамилия, отчество',a)
	print('Ваше хобби',b)

	
>>> f1()
Ваши фамилия, имя, отчество? Зацепина Виктория Дмитриевна
Чем Вы увлекаетесь? Читаю
Ваши имя, фамилия, отчество  Зацепина Виктория Дмитриевна
Ваше хобби  Читаю
>>> 