Python 3.8.10 (tags/v3.8.10:3d8993a, May  3 2021, 11:34:34) [MSC v.1928 32 bit (Intel)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> #Лабораторная работа 1 (вариант 8)
>>> def f1():
	a = input('Введите Ваши фамилию, имя, отчество: ')
	b = input('Чем Вы увлекаетесь? ')
	print('Ваши ФИО: ', a)
	print('Ваше хобби: ', b)

	
>>> f1()
Введите Ваши фамилию, имя, отчество: Каминская Ольга Валерьевна
Чем Вы увлекаетесь? Зарубежная литература XX века
Ваши ФИО:  Каминская Ольга Валерьевна
Ваше хобби:  Зарубежная литература XX века
>>> 